package com.tcwgq.demo2;

/**
 * 位运算符：&, |, ^, ~, <<, >>, >>> &与： |或： ^异或： ~反码： <<左移： >>右移： >>>无符号右移：
 */
public class OperatorDemo {
	public static void main(String[] args) {
		int a = 3;
		int b = 4;
		System.out.println(a & b);//0
		System.out.println(a | b);//7
		System.out.println(a ^ b);//7
		System.out.println(~a);//-4
	}
	/*
	 * 3:0011
	 * 4:0100
	 * &:0000
	 * |:0111
	 * ^:0111
	 * ~:00000000,00000000,00000000,00000011
	 * ~:11111111,11111111,11111111,11111100(补码)
	 * 补码：11111111,11111111,11111111,11111100
	 * 反码：11111111,11111111,11111111,11111011
	 * 原码：10000000,00000000,00000000,00000100= -4
	 * 原码：00000000,00000000,00000000,00000100= 4
	 */

}
